# EDA

In [1]:
import pandas as pd
from ydata_profiling import ProfileReport
import numpy as np

In [2]:
df = pd.read_csv('data-set.csv')

In [3]:
df.head()

,subscriber,income,age,var1,gender,house_type,lastVisit,product02
0,1,118239.80,74.32310,1.216512,f,OWNER,1/1/2012 2:09,Nee
1,2,348760.40,45.86138,3.672188,f,OWNER,1/1/2012 14:03,Ja
2,3,96111.34,43.18818,0.578956,f,OWNER,1/1/2012 23:58,Nee
3,4,73818.17,43.32941,-0.129441,m,RENTAL,1/2/2012 3:51,Ja
4,5,36469.51,34.87954,-0.127675,m,RENTAL,1/2/2012 13:50,Nee

In [16]:
df.columns

Index(['subscriber', 'income', 'age', 'var1', 'gender', 'house_type',
       'lastVisit', 'product02'],
      dtype='object')

In [9]:
df.describe()

        subscriber         income          age         var1
count  9524.000000    8966.000000  8975.000000  8952.000000
mean   4762.500000  122301.927841    49.043465    -0.105003
std    2749.486316   89007.507823    16.288764     1.480915
min       1.000000     985.849800    18.209650   -17.140300
25%    2381.750000   52975.740000    36.247210    -0.853022
50%    4762.500000  101522.700000    47.870090    -0.117858
75%    7143.250000  170981.975000    59.644960     0.679146
max    9524.000000  632975.000000   101.095400    13.600780

In [5]:
# Get count of missing values in the dataset
df.isnull().sum()

subscriber      0
income        558
age           549
var1          572
gender        555
house_type    546
lastVisit       0
product02       0
dtype: int64

In [6]:
# Checking the distribution of the null values across rows 
df.isnull().sum(axis=1).value_counts()

0    8289
2     434
3     338
1     323
4     125
5      15
Name: count, dtype: int64

In [11]:
# Drop rows that have more than 2 missing values.
df = df[df.isnull().sum(axis=1) <= 2]

In [14]:
df.isnull().sum()

subscriber      0
income        226
age           242
var1          243
gender        246
house_type    234
lastVisit       0
product02       0
dtype: int64

In [24]:
df

,subscriber,income,age,var1,gender,house_type,lastVisit,product02
0,1,118239.80,74.32310,1.216512,f,OWNER,1/1/2012 2:09,Nee
1,2,348760.40,45.86138,3.672188,f,OWNER,1/1/2012 14:03,Ja
2,3,96111.34,43.18818,0.578956,f,OWNER,1/1/2012 23:58,Nee
3,4,73818.17,43.32941,-0.129441,m,RENTAL,1/2/2012 3:51,Ja
4,5,36469.51,34.87954,-0.127675,m,RENTAL,1/2/2012 13:50,Nee
...,...,...,...,...,...,...,...,...
9519,9520,79324.85,29.57617,2.261101,m,OWNER,11/21/2016 12:09,Ja
9520,9521,215149.60,46.34125,0.590807,f,OWNER,11/21/2016 17:58,Ja
9521,9522,80558.36,37.10520,-0.099423,f,RENTAL,11/21/2016 20:27,Ja
9522,9523,158810.10,65.85983,-0.263309,f,RENTAL,11/21/2016 22:42,Ja
9523,9524,163871.50,40.13033,0.159354,f,OWNER,11/22/2016 0:20,Ja

In [25]:
df.head()

,subscriber,income,age,var1,gender,house_type,lastVisit,product02
0,1,118239.80,74.32310,1.216512,f,OWNER,1/1/2012 2:09,Nee
1,2,348760.40,45.86138,3.672188,f,OWNER,1/1/2012 14:03,Ja
2,3,96111.34,43.18818,0.578956,f,OWNER,1/1/2012 23:58,Nee
3,4,73818.17,43.32941,-0.129441,m,RENTAL,1/2/2012 3:51,Ja
4,5,36469.51,34.87954,-0.127675,m,RENTAL,1/2/2012 13:50,Nee

        subscriber         income          age         var1
count  9524.000000    8966.000000  8975.000000  8952.000000
mean   4762.500000  122301.927841    49.043465    -0.105003
std    2749.486316   89007.507823    16.288764     1.480915
min       1.000000     985.849800    18.209650   -17.140300
25%    2381.750000   52975.740000    36.247210    -0.853022
50%    4762.500000  101522.700000    47.870090    -0.117858
75%    7143.250000  170981.975000    59.644960     0.679146
max    9524.000000  632975.000000   101.095400    13.600780

In [4]:
profile = ProfileReport(df, title="Profiling Report")
profile.to_file("dataReport.html")

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

1 - Income,as expected, is skewed. We need log scaling and rounding for this if we are going to use a parametric model.

2 - Age isn't integer, should be addressed. Age is also log normal.

3 - Extract time & Date info from the date. 

4 - A lot of missing data.

5 - The Target variable is imbalanaced. We need to address this.


Complex Ideas:

1 - Fill missing values using smart imputation (KNN or Prediction)

2 - Try out different models with extra feature engineering (transformations)

3 - Use logging instead of print statments.

Creating fake data to test the model!

In [8]:
df.sample(100).drop('product02',axis=1).to_csv('fakeTest.csv',index=False)